Repository: samikeijonen/edd-paytrail
Catalog: languages/edd-paytrail-*.po
Languages: fi

source: %1$s License Key
fi: %1$s Licenssiavain

source: Deactivate License
fi: Poista lisenssiavain käytöstä

source: Billing Details
fi: Osoitetiedot

source: Billing Address
fi: Osoite

source: This is your billing address.
fi: Kirjoita osoitteesi.

source: Address line
fi: Osoiterivi

source: Billing Zip / Postal Code
fi: Postinumero

source: The zip or postal code for your billing address.
fi: Kirjoita postinumero.

source: Zip / Postal code
fi: Postinumero

source: Billing City
fi: Postitoimipaikka

source: The city for your billing address.
fi: Kirjoita postitoimipaikka.

source: City
fi: Postitoimipaikka

source: Billing Country
fi: Maa

source: The country for your billing address.
fi: Valitse maa.

source: You must enter the address
fi: Kirjoita osoite

source: You must enter the zip code
fi: Kirjoita postinumero

source: You must enter the city
fi: Kirjoita postitoimipaikka

source: You must enter the country
fi: Valitse maa

source: Status changed to Pending
fi: Tila muutettu vireillä olevaksi

source: Error: your payment could not be recorded. Please try again
fi: Virhe: Emme onnistuneet tallentamaan maksua. Ole hyvä ja kokeile uudelleen.

source: Error: Paytrail only accepts EUR as currency. Contact the site admin.
fi: Virhe: Paytrail hyväksyy vain eurot maksun yhteydessä. Ota yhteys sivun ylläpitäjään.

source: Error: we could not create your payment to Paytrail. Please try again
fi: Virhe: Emme onnistuneet luomaan maksua Paytrail-maksulle. Ole hyvä ja kokeile uudelleen.

source: Paytrail order number: %s
fi: Paytrail tilausnumero: %s

source: Error: your payment could not be processed. Please try again
fi: Virhe: Emme onnistuneet tallentamaan maksua. Ole hyvä ja kokeile uudelleen.

source: Note: You need to use EUR currency for Paytrail to work. Go to %ssettings%s.
fi: Huom! Valutaan tulee olla Euroina, jotta Paytrail toimii. Mene %sasetuksiin%s.

source: You can use Paytrail account or finnish banks.
fi: Voit käyttää maksaessasi Paytrail-tiliä tai suomalaisia verkkopankkeja.

# Paytrail settings in Gateways page
source: Paytrail Settings
fi: Paytrail asetukset

source: Configure the Paytrail settings
fi: Muokkaa Paytrailin asetuksia

source: Merchant ID
fi: Kauppiastunnus

source: Enter your Paytrail Merchant ID. This is needed in order to take payment.
fi: Kirjoita Paytrailin kauppiastunnus. Tarvitset tämän, jotta voit maksaa Paytrail-maksupalvelun kautta.

source: Merchant Secret
fi: Kauppiasvarmenne

source: Enter your Paytrail Merchant Secret. This is needed in order to take payment.
fi: Kirjoita Paytrailin kauppiasvarmenne. Tarvitset tämän, jotta voit maksaa Paytrail-maksupalvelun kautta.

source: Test Merchant ID
fi: Testikauppiastunnus

source: Enter your Paytrail test Merchant ID.
fi: Kirjoita Paytrailin testikauppiastunnus.

source: Test Merchant Secret
fi: Testikauppiasvarmenne

source: Enter your Paytrail test Merchant Secret.
fi: Kirjoita Paytrailin testikauppiasvarmenne.

# Paytrail settings in Extensions page
source: Paytrail Settings
fi: Paytrail asetukset

source: Show Paytrail image
fi: Näytä Paytrail-kuva

source: Check this if you want to show Paytrail image on checkout page.
fi: Valitse tämä, jos haluat näyttää Paytrail-kuvan maksusivulla.

source: Additional user info
fi: Käyttäjän lisätiedot

source: Check this if you want to show phone number and company name fields on checkout page. This info is also send to Paytrail account if you use Finnish address fields below.
fi: Valitse tämä, jos haluat näyttää puhelinnumerokentän ja yrityskentän maksusivulla. Nämä tiedot lähetetään Paytrail-tilille, jos valitset alla olevan vaihtoehdon näyttää suomalaiset osoiterivit.

source: Finnish address fields
fi: Suomalainen osoiterivi

source: Check this if you want to show address fields like in Finland on checkout page. Address and product info is also send to Paytrail account in this case.
fi: Valitse tämä, jos haluat näyttää osoiterivit maksusivulla niinkuin Suomessa on tapana. Tässä tapauksessa osoitetiedot ja tuotteiden tiedot lähetetään Paytrail-tilille.

source: Phone Number
fi: Puhelinnumero

source: Enter your phone number.
fi: Kirjoita puhelinnumero.

source: Company Name
fi: Yrityksen nimi

source: Enter the name of your company.
fi: Kirjoita yrityksen nimi.

source: Phone:
fi: Puhelin:

source: Company:
fi: Yritys:

source: EDD Paytrail Gateway
fi: Paytrail maksutapa Easy Digital Downloads -lisäosalle.

source: Adds Paytrail payment gateway to Easy Digital Downloads plugin
fi: Lisää Paytrail maksumahdollisuuden Easy Digital Downloads -lisäosaan
